Examinator/src/Catalogs/ПодборкиСУЗ/ПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрезентация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбиратьЭлементыИзРубрикатора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификационнаяГруппировка</name>
    <type>
      <types>CatalogRef.КлассификационныеГруппировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьГруппыЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКлассификатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтартовуюСтраницу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЭлементов</name>
    <type>
      <types>EnumRef.ВариантыПредставленияЭлементовПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СвернутьРазделы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНавигации</name>
    <type>
      <types>EnumRef.ТипыНавигацииПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГруппЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйРесурс</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыравниваниеСтартовогоРесурса</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСложностиПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСложностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТаймер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматТаймера</name>
    <type>
      <types>EnumRef.ФорматыТаймераСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйРесурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НумероватьСтраницы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредыдущиеПопытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьОткрытыеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтоимостьВопроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьКомментарииВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияНаФинальнойСтранице</name>
    <type>
      <types>EnumRef.ИнформацияНаФинальнойСтраницеТестаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Презентация</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыЭлектронныхРесурсовСУЗ/ТипыЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКурс</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ВариантыПредставленияЭлементовПодборкиСУЗ/ВариантыПредставленияЭлементовПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПредставленияЭлементовПодборкиСУЗ</name>
  <enumValues>
    <name>Последовательно</name>
  </enumValues>
  <enumValues>
    <name>КлассификационнаяТаблица</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ЭлементыПодборкиСУЗ/ЭлементыПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ПодборкиСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.КлассификаторОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Якорь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВопросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактироватьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ПодборкиСУЗ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		ТипОбъектаСУЗ = Перечисления.ТипыОбъектовСУЗ.collection;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;
		
	Если НЕ ЭтоГруппа Тогда
		
		Если НЕ ЭтоНовый() Тогда
			ВыполнитьПроверкуПодборки(Отказ);		
		КонецЕсли;
			
		Справочники.ПодборкиСУЗ.УстановитьОбязательныеРеквизиты(ЭтотОбъект);
		
		РазработкаСУЗ.ПереименоватьАвтоРодителей(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Создаем или обновляем ресурс, если тест входит в электронный ресурс типа Тест
	
	Если ДополнительныеСвойства.Свойство("СоздатьЭлектронныйРесурс") Тогда
		
		ЭлектронныйРесурс = Неопределено;
		РодительЭлектронногоРесурса = Неопределено;
		ДополнительныеСвойства.Свойство("РодительЭлектронногоРесурса", РодительЭлектронногоРесурса); 
		
		Справочники.ПодборкиСУЗ.ОбновитьЭлектронныйРесурсТеста(Ссылка, ЭлектронныйРесурс, Отказ, РодительЭлектронногоРесурса);
		
		ДополнительныеСвойства.Вставить("ЭлектронныйРесурс", ЭлектронныйРесурс);
		
	Иначе
		
		Если ДополнительныеСвойства.Свойство("ЭлектронныйРесурс")
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДополнительныеСвойства.ЭлектронныйРесурс, "Тип") = Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест Тогда
			
			Справочники.ПодборкиСУЗ.ОбновитьЭлектронныйРесурсТеста(Ссылка, ДополнительныеСвойства.ЭлектронныйРесурс, Отказ);
			
		КонецЕсли;		
		
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ВыполнитьПроверкуПодборки(Отказ)
	
	Если НЕ ПоказыватьНавигацию Тогда // Делаем проверку, чтобы каждая группа элементов содержала хотя бы один вопрос.
		    		
		ЕстьГруппыБезВопросов = Ложь;
		    		
		ГруппыЭтойПодборки = Справочники.ПодборкиСУЗ.ПолучитьГруппыЭлементовПодборки(Ссылка);
		    		
		Для каждого ТекущаяГруппа Из ГруппыЭтойПодборки Цикл
		    		   
			Если ТекущаяГруппа.ЭтоГруппа Тогда
						
				ВсеЭлементыГруппы = Справочники.ПодборкиСУЗ.ВсеЭлементы(Ссылка, ТекущаяГруппа.Ссылка);
				ЕстьВГруппеВопрос = Ложь;
				Для каждого ЭлементГруппы Из ВсеЭлементыГруппы Цикл
					Если ТипЗнч(ЭлементГруппы.СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
						ЕстьВГруппеВопрос = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
							
				Если НЕ ЕстьВГруппеВопрос Тогда
					ЕстьГруппыБезВопросов = Истина;
				КонецЕсли;
							
			Иначе
				
				Если ТипЗнч(ТекущаяГруппа.СсылкаНаОбъектСУЗ) <> Тип("СправочникСсылка.ВопросыСУЗ") Тогда
					ЕстьГруппыБезВопросов = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
		    		
		КонецЦикла;
		
		Если ЕстьГруппыБезВопросов Тогда
			Текст = НСтр("ru = 'При снятом флажке ""Показывать навигацию"" каждая группа элементов должна содержать хотя бы один вопрос'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПредставлениеЭлементов = Перечисления.ВариантыПредставленияЭлементовПодборкиСУЗ.КлассификационнаяТаблица Тогда
		
		// Проверяем, чтобы каждая группа содержала более одного класса.
		// Если в группе один класс и есть еще элементы без класса, выводим предупреждение.
		// Имеет смысл при условии, что не указана классификационная группировка.
		
		Если НЕ ЗначениеЗаполнено(КлассификационнаяГруппировка) Тогда
			
			ГруппыЭтойПодборки = Справочники.ПодборкиСУЗ.ПолучитьГруппыЭлементовПодборки(Ссылка);
			
			Для каждого ТекущаяГруппа Из ГруппыЭтойПодборки Цикл
				
				Запрос = Новый Запрос("	
					|ВЫБРАТЬ
					|	ЭлементыПодборкиСУЗ.Класс КАК Класс
					|ИЗ
					|	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
					|ГДЕ
					|	ЭлементыПодборкиСУЗ.Владелец = &Владелец
					|	И ЭлементыПодборкиСУЗ.ПометкаУдаления = ЛОЖЬ
					|	И ЭлементыПодборкиСУЗ.Родитель В ИЕРАРХИИ(&Родитель)
					|	И ЭлементыПодборкиСУЗ.ЭтоГруппа = ЛОЖЬ
					|	И ЭлементыПодборкиСУЗ.Класс <> &НетКласса
					|ИТОГИ
					|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Класс)
					|ПО
					|	ОБЩИЕ");

				Запрос.УстановитьПараметр("Владелец", ЭтотОбъект.Ссылка); 
				Запрос.УстановитьПараметр("Родитель", ТекущаяГруппа.Ссылка); 
				Запрос.УстановитьПараметр("НетКласса", Справочники.КлассификаторОбъектовСУЗ.ПустаяСсылка()); 
				
				РезультатЗапроса = Запрос.Выполнить().Выгрузить();
				
				Если РезультатЗапроса.Количество() > 0 Тогда
					КоличествоРазличных = РезультатЗапроса.Получить(0).Класс;
				Иначе
					КоличествоРазличных = 0;
				КонецЕсли;
				
				Если КоличествоРазличных = 1 Тогда
					
					Запрос2 = Новый Запрос("	
						|ВЫБРАТЬ
						|	ЭлементыПодборкиСУЗ.Класс КАК Класс
						|ИЗ
						|	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
						|ГДЕ
						|	ЭлементыПодборкиСУЗ.Владелец = &Владелец
						|	И ЭлементыПодборкиСУЗ.ПометкаУдаления = ЛОЖЬ
						|	И ЭлементыПодборкиСУЗ.Родитель В ИЕРАРХИИ(&Родитель)
						|	И ЭлементыПодборкиСУЗ.ЭтоГруппа = ЛОЖЬ
						|	И ЭлементыПодборкиСУЗ.Класс = &НетКласса");
					
					Запрос2.УстановитьПараметр("Владелец", ЭтотОбъект.Ссылка); 
					Запрос2.УстановитьПараметр("Родитель", ТекущаяГруппа.Ссылка); 
					Запрос2.УстановитьПараметр("НетКласса", Справочники.КлассификаторОбъектовСУЗ.ПустаяСсылка()); 
					
					РезультатЗапроса2 = Запрос2.Выполнить().Выгрузить();
					
					Если РезультатЗапроса2.Количество() > 0 Тогда
						Текст = НСтр("ru = 'Для группы """+ ТекущаяГруппа.Наименование +""" элементы, не имеющие класса, будут размещены в одной колонке с элементами, которым назначен класс'");
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
					КонецЕсли;
					
				КонецЕсли;
				
				
			КонецЦикла;
			
		КонецЕсли;
				
	КонецЕсли;
	
	
КонецПроцедуры // ВыполнитьПроверкуПодборки()

#КонецОбласти

#КонецЕсли
